Revit 2026 API

# AnalysisDisplayMarkersAndTextSettingsMarkerSize Property

---

Size of marker.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MarkerSize { get; set; }
```
```vb
Public Property MarkerSize As Double
	Get
	Set
```
```cpp
public:
property double MarkerSize {
	double get ();
	void set (double value);
}
```
```fsharp
member MarkerSize : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentsInconsistentException | When setting this property: markerSize is negative |

#### Reference

AnalysisDisplayMarkersAndTextSettings Class

Autodesk.Revit.DB.Analysis Namespace